<html>

<head>
<title>Hilfe zum Kurs: Einf&uuml;hrung in Java</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link rel="stylesheet" type="text/css" href="../Format/Format.css">
<script src="../BrowserCheck.js" type="text/javascript"></script>
<script language="JavaScript">

  Normal3 = new Image();
  Normal3.src = "../Stat-Gifs/PfeilNachOben.gif";
  Highlight3 = new Image();
  Highlight3.src = "../Stat-Gifs/PfeilNachOben_Mo.gif";

 function Bildwechsel(Bildobjekt,PName)
   {

    command= "window.document."+PName+".src = Bildobjekt.src";
    eval(command);
  }

</script>
</head>

<script language="JavaScript">
<!--
	if (OP || OP711 || OP721 || (navigator.userAgent.indexOf("Netscape6") > -1)) document.write('<body id="top" bgcolor="#FFFFFF" scroll="auto">');
	else document.write('<body bgcolor="#FFFFFF">');
//-->
</script>

<table border="0" cellpadding="3" cellspacing="0" width="100%">
  <tr>
    <td id="titel">Hilfe</td>
      <td id="titel" align="right"><div style="margin-top:2px"><img src="../Medien/Ticon.gif" width="54" width="17"></div></td>
  </tr>
</table>



<table border="0" width="100%" cellspacing="5" cellpadding="5">
  <tr>
  <td>
  <b>
  <a href="#hilf_1" id="hilfe">Navigation im Kurs</a><br>
  <a href="#hilf_2" id="hilfe">Navigation auf einer Kursseite</a> <br></b></td>
  </tr>


<tr>
    <td><br><a name="hilf_1"><b>Navigation im Kurs</b></a></td>
  </tr>
  <tr>
    <td>Die Schaltfl&auml;chen am linken Bildschirmrand dienen zur
    Navigation im Kurs oder rufen Servicefunktionen wie Hilfe, Notizblatt, Volltextsuche und Lesezeichen auf.</td>
  </tr>
  <tr>
    <td><img src="../Stat-Gifs/InhaltWeiss.gif" alt="Inhalt.gif" >&nbsp; <br>
    Ruft das Inhaltsverzeichnis des Kurses auf. Zun&auml;chst wird die Kapitelstruktur des
    Kurses angezeigt. Wenn Sie auf das Ordnersymbol zu einem Kapitel klicken, werden auch die
    Unterkapitel angezeigt. Mit einem weiteren Klick auf das Ordnersymbol schlie&szlig;en Sie die
    Anzeige der Unterkapitel. Mit einem Klick auf einen Kapitel-Titel oder Unterkapitel-Titel verzweigen Sie
    direkt in den entsprechenden Kursausschnitt. Haben Sie ein Kapitel/Unterkapitel vollst&auml;ndig bearbeitet, wird es entsprechend markiert. So k&ouml;nnen Sie jederzeit Ihren aktuellen Kursbearbeitungsstand ablesen.</td>
  </tr>
  <tr>
    <td><img src="../Stat-Gifs/IndexWeiss.gif" alt="Index.gif" >&nbsp; <br>
    Ruft das Indexverzeichnis des Kurses auf. Im Index
    werden alle Schlagw&ouml;rter dieses Kurses aufgef&uuml;hrt. Jedem Eintrag sind Links zugeordnet. Diese
    erm&ouml;glichen Ihnen den direkten Sprung auf die Kursseiten, die inhaltlich mit dem gew&auml;hlten
    Eintrag in Beziehung stehen.
    </td>
  </tr>
  <tr>
    <td><img src="../Stat-Gifs/GlossarWeiss.gif" alt="Glossar.gif"><br>
    Ruft ein Verzeichnis mit Glossareintr&auml;gen auf. Im Glossar
    werden wichtige Fachbegriffe des Kurses erl&auml;utert.</td>
  </tr>
  <tr>
    <td><img src="../Stat-Gifs/LiteraturWeiss.gif" alt="Literatur.gif"><br>
    Ruft ein bibliografisches Verzeichnis mit empfohlener Literatur auf.
    </td>
  </tr>
  <tr>
    <td><img src="../Stat-Gifs/LesezWeiss.gif" alt="Lesezeichen.gif"><br>
    Ruft eine Lesezeichenfunktion auf. Durch Anklicken von
    "Neues Lesezeichen setzen" setzen Sie einen Marker auf die aktuelle Seite. Diese Seite wird
    damit in die Lesezeichenliste eingetragen und kann sp&auml;ter direkt angew&auml;hlt werden. <br> Durch
    Anklicken von &quot;L&ouml;schen&quot; entfernen Sie einzelne Eintr&auml;ge, mit der Schaltfl&auml;che &quot;Alle Lesezeichen l&ouml;schen&quot;
    l&ouml;schen Sie alle aufgelisteten Lesezeichen. &Uuml;ber die Schaltfl&auml;che mit
   dem Drucker-Symbol k&ouml;nnen Sie die Liste der eingetragenen Lesezeichen ausdrucken.
    <br><br>
    <a href="#top" id="anker" onMouseOver="Bildwechsel(Highlight3,'b1');self.status='';return true" onMouseOut="Bildwechsel(Normal3,'b1');self.status='';return true">
    <img name =b1 src="../Stat-Gifs/PfeilNachOben.gif" border="0"></a></td>
  </tr>
  <tr>
    <td><img src="../Stat-Gifs/NotizWeiss.gif" alt="Notiz.if"><br>
    Ruft ein Notizblatt auf. Hier k&ouml;nnen Sie Ihre
    pers&ouml;nlichen Anmerkungen zum Kurs allgemein oder zu den einzelnen Kapiteln eintragen.Mit den Schaltfl&auml;chen
    &quot;Notiz speichern&quot; / &quot;Notiz l&ouml;schen&quot; speichern bzw. l&ouml;schen Sie die Notizen zum Kurs oder
   zum angew&auml;hlten Kapitel. Mit &quot;Alle Notizen l&ouml;schen&quot; werden Ihre gesamten Notizen zum Kurs und zu allen
   Kapiteln gel&ouml;scht. Gespeicherte Notizen k&ouml;nnen Sie f&uuml;r Ihre Unterlagen ausdrucken. &Uuml;ber die Schaltfl&auml;che mit
   dem Drucker-Symbol gelangen Sie in die Druckvorschau. Durch (Doppel-)Klick auf &quot;Notiz-Eintrag drucken&quot; erteilen Sie den Druckauftrag. <br>Wichtiger Hinweis: Die Funktion Notizblatt ist nur f&uuml;r k&uuml;rzere Notizen gedacht. Lange Texte k&ouml;nnen hier nicht gespeichert werden. In diesem Fall erhalten Sie eine entsprechende R&uuml;ckmeldung.<br>M&ouml;chten Sie Ihre Notizen durchsuchen, k&ouml;nnen Sie Ihre(n) Suchbegriff(e) in das Textfeld &quot;Suchen nach&quot; eingeben. Durch (Doppel-)Klick auf den &quot;Lupe&quot;-Button oder durch Dr&uuml;cken der Return- bzw. Enter-Taste wird die Suche gestartet. Das Suchergebnis wird in einem Extrafenster angezeigt und kann direkt angew&auml;hlt werden.
    </td>
  </tr>
  <tr>
      <td><img src="../Stat-Gifs/Suchenweiss.gif" alt="Suchen.gif"><br>
      Ruft eine Suchefunktion f&uuml;r alle Texte des Kurses auf. Hier k&ouml;nnen Sie Ihre(n)
      Suchbegriff(e) in das Textfeld &quot;Im Kurs suchen nach&quot; eingeben und entweder durch (Doppel-)Klick auf den &quot;Lupe&quot;-Button oder durch Dr&uuml;cken der Return- bzw. Enter-Taste den gesamten Kurs im Volltext durchsuchen. Die Suchergebnisse (max. 40 Treffer)  k&ouml;nnen direkt angew&auml;hlt werden. Durch &Uuml;berschreiben des Suchbegriffs und (Doppel-)Klick auf den &quot;Lupe&quot;-Button oder durch Dr&uuml;cken der Return- bzw. Enter-Taste starten Sie die Volltextsuche erneut.</td>
  </tr>

  <tr>
    <td><img src="../Stat-Gifs/HilfeWeiss.gif" alt="Hilfe.gif" ><br>
    Ruft diese Hilfetexte zur Bedienung des Kurses auf.</td>
  </tr>
  <tr>
    <td><img src="../Stat-Gifs/ImpressWeiss.gif" alt="Impressum.gif"><br>
    Gibt Informationen zu den Produzenten dieses Kurses.</td>
  </tr>

  <tr>
    <td><img src="../Stat-Gifs/LeftWeiss.gif" alt="Zur&uuml;ck.gif"><br>
    Ruft die sachlogisch vorausgehende Seite eines Kapitels auf. Um
    auf Ihren pers&ouml;nlichen Kurspfad zur&uuml;ckzugehen, nutzen Sie bitte die Zur&uuml;ck-Funktion des
    Browsers.</td>
  </tr>

  <tr>
    <td><img src="../Stat-Gifs/RightWeiss.gif" alt="Vor.gif" ><br>
    Ruft die sachlogisch folgende Kursseite auf.
    <br><br>
    <a href="#top" id="anker" onMouseOver="Bildwechsel(Highlight3,'b2');self.status='';return true" onMouseOut="Bildwechsel(Normal3,'b2');self.status='';return true">
    <img name=b2 src="../Stat-Gifs/PfeilNachOben.gif" border="0"></a></td>
  </tr>

  <tr>
    <td><a name="hilf_2"><br><b>Navigation auf einer Kursseite</b></a></td>
  </tr>

  <tr>
    <td>Auf der Kursseite wird der Lehrtext mit Quellcode-Grafiken, Abbildungen und vertonten Animationen dargestellt. &Uuml;ber Schaltfl&auml;chen haben Sie die M&ouml;glichkeit,
	erg&auml;nzende Informationen, l&auml;ngere Programmcodes, Applets und unterst&uuml;tzende Screenshots aufzurufen.
     Die Schaltfl&auml;chen sind entsprechend gekennzeichnet.<br><br>Au&szlig;erdem finden Sie auf der Kursseite die folgenden <b>Formatierungen</b>: <br>
      <table cellspacing="2" cellpadding="2">
      <tr><td><img src="Liste_Norm.gif" width="14" height="14"></td>
	  	           <td><b>Fettdruck</b> f&uuml;r Hervorhebungen </td>
	         </tr>
	         <tr><td valign="top"><img src="Liste_Norm.gif" width="14" height="14"></td>
	  	            <td><i>Kursivstellung</i> f&uuml;r Eigennamen und englische Begriffe</td>
	         </tr>
	         <tr><td valign="top"> <img src="Liste_Norm.gif" width="14" height="14"></td>
	  	            <td><u><font color="#0000FF">Kapitel 1.4</font></u> f&uuml;r interne Verweise, die auf das angegebene Sprungziel verzweigen</td>
	         </tr>

	           <tr><td valign="top"><img src="Liste_Norm.gif" width="14" height="14"></td>
	           <td><font class="code"><font color="#0000FF"><u>www.url.de</u></font></font> f&uuml;r externe Verweise, die die angegebene Internetadresse (online) aufrufen, und für Verweise auf die Dokumentation (CD-ROM).</td>
       </tr>
         <tr><td valign="top"><img src="Liste_Norm.gif" width="14" height="14"></td>
         <td><font id="glos"><u>Java</u></font> f&uuml;r Glossareintr&auml;ge, die das Glossar dieses Kurses aufrufen </td>
       </tr>
       <tr>
	 <td valign="top"><img src="Liste_Norm.gif" width="14" height="14"></td>
         <td><font class="code">Courier New</font> f&uuml;r Programmier-Syntax, Dateinamen un Verzeichnisse</td>
       </tr>

      </table>
    </td>
  </tr>
  <tr>
  	    <td><br>Zur besseren Lesbarkeit ist die <b>Java-Syntax</b> wie folgt formatiert: <br>
  	      <table cellspacing="2" cellpadding="2">

  		           <tr><td valign="top"><img src="Liste_Norm.gif" width="14" height="14"></td>
  		           <td><font class="code"><font id="kw">public</font></font> f&uuml;r Schl&uuml;sselworte</td>
  	       </tr>
  	         <tr><td valign="top"><img src="Liste_Norm.gif" width="14" height="14"></td>
  			 		           <td><font class="code"><font id="orange">&quot;Hallo&quot;</font></font> f&uuml;r Zeichenketten, die ausgegeben werden</td>
  	       </tr>
  	       <tr><td valign="top"><img src="Liste_Norm.gif" width="14" height="14"></td>
		     			 		           <td><font class="code">println</font> f&uuml;r die allgemeine Java-Syntax sowie f&uuml;r andere, im Kurs verwendete Programmiersprachen wie XML, SQL etc.</td>
  	       </tr>

  	      </table>
  	    </td>
    </tr>


  <tr>
     <td><br>Der rechte Randbereich dient der informativen Unterst&uuml;tzung des Lehrtextes. Hier befinden sich <br>
	<table cellspacing="2" cellpadding="2">
     		<tr>
			<td valign="basline"><img src="Liste_Norm.gif" width="14" height="14"></td>
         		<td><b>Piktogramme</b>, die besondere Passagen im Lehrtext kennzeichnen</td>
     		</tr>
     		<tr>
         		<td>&nbsp;</td>
         		<td>
				<table>
					<tr>
                      				<td align="center"><img src="../Medien/Lern.gif" width="36" height="36" alt="Hinweis: Lernziel(e)"></td>
                       				<td width="8">&nbsp;</td>
                      				<td>Lernziel</td>
                    			</tr>
                    			<tr>
                      				<td align="center"><img src="../Medien/Definition.gif" width="36" height="36" alt="Hinweis: Definition(en)"></td>
                       				<td width="8">&nbsp;</td>
                      				<td>Definition</td>
                    			</tr>
					<tr>
                      				<td align="center"><img src="../Medien/Hinweis.gif" width="36" height="36" alt="wichtiger Hinweis"></td>
                       				<td width="8">&nbsp;</td>
                      				<td>wichtiger Hinweis</td>
                    			</tr>
					<tr>
                      				<td align="center"><img src="../Medien/Beispiel.gif" width="36" height="36" alt="Hinweis: Beispiel(e)"></td>
                       				<td width="8">&nbsp;</td>
                      				<td>Beispiel oder Beispielprogramm</td>
                    			</tr>
					<tr>
                      				<td align="center"><img src="../Medien/Praxis.gif" width="36" height="36" alt="Hinweis: Praxisbeispiel"></td>
                       				<td width="8">&nbsp;</td>
                      				<td>Praxisbeispiel  bzw. Praxisaufgabe</td>
                    			</tr>
					<tr>
                      				<td align="left"><img src="../Medien/Ani_Icon.gif" width="36" height="36" alt="Hinweis: animiertes Beispiel"></td>
                       				<td width="8">&nbsp;</td>
                      				<td>animiertes Beispiel</td>
                    			</tr>
       </table>
       </td>
   		</tr>



     		<tr>
			<td><br><img src="Liste_Norm.gif" width="14" height="14"></td>
         		<td><br><b>Pfadangaben</b> f&uuml;r Beispielprogramme und Praxisbeispiele</td>
		</tr>

     		<tr>
         		<td>&nbsp;</td>
          		<td>
				<table>
					<tr>
                     				<td><table>
         						<tr>
								<td valign="top" align="left"><img src="../Medien/Beispiel.gif" width="36"
      								height="36" alt="Hinweis: Beispiel(e) im Lehrtext"><br><font id="ex"><u>Bsp03Strings.java</u></font>
								</td>
								<td>&nbsp;&nbsp;&nbsp;</td>

								<td valign="top" align="left"><img src="../Medien/Praxis.gif" width="36"
      								height="36" alt="Hinweis: Praxisbeispiel(e) im Lehrtext"><br><font id="ex"><u>Bsp03Strings.java</u></font>
								</td>
							</tr>
						     </table>
						</td>
					</tr>
				</table>
   			</td>
  		</tr>





        	<tr>
         		<td>&nbsp;</td>
         		<td>Im Kurs werden in der Regel nur die charakteristischen Abschnitte oder Zeilen erkl&auml;rt. Die vollst&auml;ndigen Beispielprogramme sind auf der CD-ROM im Ordner
           		<font class="code">work</font> abgelegt. F&uuml;r jedes Kapitel gibt es einen Unterordner (z.B. <font class="code">Kap1</font> steht f&uuml;r Kapitel 1, <font class="code">Kap2</font> steht f&uuml;r Kapitel 2, usw.),
	    		in dem sich die angegebenen Dateien (hier im Beispiel ist es die Datei  <font class="code">Bsp03Strings.java</font>) befinden.
			Im Kurs k&ouml;nnen Sie durch Klick auf die <u>Pfadangabe</u> eine Text-Version (<font class="code">txt</font>)
			der entsprechenden Datei einsehen. Programmierbeispiele zum &Uuml;ben sind als Praxisbeispiele ausgewiesen.<br>


			<br><b>Hinweis:</b><br>
			Wenn Sie die abgelegten Beispielprogramme bearbeiten m&ouml;chten, funktioniert dies auf der
			CD-ROM wegen des Schreibschutzes verst&auml;ndlicherweise nicht. Sie sollten daher die Dateien
			auf Ihre Festplatte kopieren. F&uuml;r die Bearbeitung der Beispiele ist es egal,
			in welches Verzeichnis Sie die Dateien ablegen. Im Kurstext wird als Platzhalter meist das
			Verzeichnis <font class="code">d:\work</font> verwendet. Dabei gibt es ein kleines Problem:
			Dateien, die von der CD-ROM auf die Festplatte kopiert werden, erhalten automatisch einen Schreibschutz.
			Damit k&ouml;nnen die Quelltexte nicht mehr ver&auml;ndert und kompiliert werden. Aus diesem Grund finden
			Sie im Ordner <font class="code">work</font> eine ausf&uuml;hrbare Datei (<font class="code">work.exe</font>), die Ihnen den kompletten <font class="code">work</font>-Ordner auf Ihre Festplatte kopiert.<br>
            		</td>
        	</tr>

         </table><br>
     <span id="norm">Jeweils am Ende eines Kapitels befinden sich <b>&Uuml;bungen</b> zur Wissens&uuml;berpr&uuml;fung.
     &Uuml;ber Schaltfl&auml;chen k&ouml;nnen Sie Ihre Eingabe auswerten, die L&ouml;sung abrufen
     oder Ihre Eingabe l&ouml;schen. Unter jeder &Uuml;bung finden Sie Links, die auf inhaltlich relevante Kursseiten verzweigen.</span><br><br>
    <a href="#top" id="anker" onMouseOver="Bildwechsel(Highlight3,'b3');self.status='';return true" onMouseOut="Bildwechsel(Normal3,'b3');self.status='';return true">
    <img name=b3 src="../Stat-Gifs/PfeilNachOben.gif" border="0"></a></td>
  </tr>
</table>
</body>
</html>
